InformationRegisters/ПереносыСроковВыполненияПроцессовИЗадач.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>ПереносыСроковВыполненияПроцессовИЗадач</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>БизнесПроцессПереноса</Name>
					<Comment>Заявка, в рамках которой произведен перенос срока</Comment>
					<Type>
						<v8:Type>cfg:BusinessProcessRef.РешениеВопросовВыполненияЗадач</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Итерация</Name>
					<Comment>Номер итерации согласования заявки на перенос срока, в рамках которой произведен перенос</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КомментарийАвтора</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НовыйСрок</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтарыйСрок</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ДатаПереносаСрока</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Предмет</Name>
					<Type>
						<v8:Type>cfg:TaskRef.ЗадачаИсполнителя</v8:Type>
						<v8:TypeSet>cfg:BusinessProcessRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ПереносыСроковВыполненияПроцессовИЗадач/Forms/ФормаЗаписи/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если НЕ ПолучитьФункциональнуюОпцию("ИспользоватьДатуИВремяВСрокахЗадач") Тогда
		Элементы.СтарыйСрок.Формат = "ДФ='dd.MM.yyyy'";
		Элементы.НовыйСрок.Формат = "ДФ='dd.MM.yyyy'";
	КонецЕсли;
	
	Если ТипЗнч(Запись.Предмет) = Тип("ЗадачаСсылка.ЗадачаИсполнителя") Тогда
		Заголовок = НСтр("ru = 'Запись о переносе срока исполнения задачи'; en = 'Record on task postponement'");
		Элементы.Предмет.Заголовок = НСтр("ru = 'Задача'; en = 'Task'");
	Иначе
		Заголовок = НСтр("ru = 'Запись о переносе срока исполнения процесса'; en = 'Record on process postponement'");
		Элементы.Предмет.Заголовок = НСтр("ru = 'Процесс'; en = 'Process'");
	КонецЕсли;
	
	Если ТипЗнч(Запись.СтарыйСрок) = Тип("Число") Тогда
		Если ПолучитьФункциональнуюОпцию("ИспользоватьГрафикиРаботы") Тогда
			Элементы.ДекорацияНовыйСрокПодпись.Заголовок =	
				ДелопроизводствоКлиентСервер.ПолучитьПодписьРабочихДней(Запись.НовыйСрок);
			Элементы.ДекорацияСтарыйСрокПодпись.Заголовок =	
				ДелопроизводствоКлиентСервер.ПолучитьПодписьРабочихДней(Запись.СтарыйСрок);	
		Иначе
			Элементы.ДекорацияНовыйСрокПодпись.Заголовок =	
				ДелопроизводствоКлиентСервер.ПолучитьПодписьДней(Запись.НовыйСрок);
			Элементы.ДекорацияСтарыйСрокПодпись.Заголовок =	
				ДелопроизводствоКлиентСервер.ПолучитьПодписьДней(Запись.СтарыйСрок);	
		КонецЕсли;
		Элементы.НовыйСрок.Ширина = 3;
		Элементы.СтарыйСрок.Ширина = 3;
	Иначе
		Элементы.ДекорацияНовыйСрокПодпись.Заголовок = 
			ПереносСроковВыполненияЗадачВызовСервера.ПолучитьПодписьДлительностьПереноса(
				Неопределено, 
				Запись.СтарыйСрок,
				Запись.НовыйСрок);
		Элементы.ДекорацияСтарыйСрокПодпись.Видимость = Ложь;
		Элементы.НовыйСрок.Ширина = 11;
		Элементы.СтарыйСрок.Ширина = 11;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ПредметНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Если ТипЗнч(Запись.Предмет) = Тип("ЗадачаСсылка.ЗадачаИсполнителя") Тогда
		БизнесПроцессыИЗадачиКлиент.ОткрытьФормуВыполненияЗадачи(Запись.Предмет);
	Иначе
		ПоказатьЗначение(, Запись.Предмет);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗакрытьФорму(Команда)
	
	Закрыть();
	
КонецПроцедуры

#КонецОбласти
